{
  "news": [
    {
      "newsID": "mega_update_2025",
      "titleKey": "Mega Aggiornamento 2025 - Tutto Quello Che Devi Sapere!",
      "bodyKey": "Comandanti, siamo entusiasti di annunciare il nostro aggiornamento più grande di sempre! Questo massiccio carico di contenuti porta cambiamenti rivoluzionari a Glam Rock TD che trasformeranno la vostra esperienza di gioco.\n\nNUOVE MODALITÀ DI GIOCO: Presentiamo la Modalità Infinita dove affronterai ondate infinite con difficoltà crescente, e la Modalità Sfida con modificatori giornalieri a rotazione che metteranno alla prova le tue abilità strategiche. Competi nelle classifiche globali e guadagna ricompense esclusive!\n\nSISTEMA DI EVOLUZIONE TORRI: Le tue torri possono ora evolversi oltre il livello 5! Ogni torre ha tre percorsi evolutivi unici che cambiano drasticamente il loro comportamento. Sceglierai il Percorso Perforante della Torre Laser per la massima penetrazione, la Divisione del Raggio per il controllo della folla, o il Percorso Sovraccarico per danni devastanti su singolo bersaglio?\n\nNUOVI TIPI DI NEMICI: Affronta 15 nuove varianti di nemici tra cui Unità Scudate che richiedono danni perforanti, Nemici Rigeneranti che si curano nel tempo, e i terrificanti Boss Rush con fasi multiple e meccaniche uniche.\n\nRIVOLUZIONE PROGRESSIONE: Abbiamo completamente ridisegnato il sistema di progressione! Sblocca potenziamenti permanenti attraverso il nuovo Sistema Prestigio, personalizza il tuo profilo comandante con achievement e titoli, e goditi la rinnovata struttura delle missioni giornaliere con ricompense migliori.\n\nFUNZIONI COMMUNITY: Unisciti a gilde con fino a 50 membri, condividi strategie personalizzate, partecipa a raid di gilda e compete in tornei settimanali con premi!\n\nQUALITÀ DELLA VITA: Auto-potenziamento torri, funzionalità vendita rapida, controlli touch migliorati, ottimizzazioni prestazioni per dispositivi più vecchi e opzioni accessibilità inclusa la modalità daltonici.\n\nQuesto aggiornamento arriva il 25 gennaio 2025. Pre-registrati ora per ricevere una skin esclusiva Torre del Fondatore e 1000 valuta premium! Ci vediamo sul campo di battaglia!",
      "date": "18 Gennaio 2025",
      "iconUrl": ""
    },
    {
      "newsID": "winter_event_2025",
      "titleKey": "Evento Invernale 2025!",
      "bodyKey": "Preparati per l'Evento Invernale! Dal 20 al 31 Gennaio potrai affrontare livelli esclusivi a tema natalizio e sbloccare ricompense uniche. Non perdere questa occasione!",
      "date": "15 Gennaio 2025",
      "iconUrl": ""
    },
    {
      "newsID": "new_towers_announcement",
      "titleKey": "Nuove Torri Disponibili",
      "bodyKey": "Scopri le tre nuove torri aggiunte nell'ultimo aggiornamento! La Torre Laser perfora i nemici, la Torre Congelante li rallenta e la Torre Esplosiva colpisce un'area. Sperimenta nuove strategie!",
      "date": "10 Gennaio 2025",
      "iconUrl": ""
    }
  ]
}
